recipes = {
    'Омлет с травами': ['Яйцо', 'Молоко', 'Зелень'],
    'Жареный картофель': ['Картофель', 'Масло'],
    'Картофельное пюре': ['Картофель', 'Молоко', 'Масло'],
    'Куриный суп': ['Курица', 'Картофель', 'Лук'],
    'Щи': ['Капуста', 'Картофель', 'Морковь', 'Лук'],
    'Борщ': ['Свекла', 'Картофель', 'Капуста', 'Морковь', 'Лук'],
    'Уха': ['Рыба', 'Картофель', 'Лук'],
    'Рис с овощами': ['Рис', 'Морковь', 'Горошек', 'Кукуруза'],
    'Макароны "По-флотски"': ['Макароны', 'Фарш', 'Лук'],
    'Плов': ['Рис', 'Мясо', 'Морковь', 'Лук'],
    'Овощное рагу': ['Картофель', 'Морковь', 'Зелень'],
    'Запеченная рыба': ['Рыба', 'Лимон', 'Зелень'],
    'Рыбные котлеты': ['Рыба', 'Лук'],
    'Гречка с мясом': ['Гречка', 'Мясо'],
    'Курица запеченная': ['Курица', 'Специи'],
    'Ленивые голубцы': ['Фарш', 'Рис', 'Капуста'],
    'Фаршированный перец': ['Фарш', 'Рис', 'Болгарский перец'],
    'Картофель запеченный с мясом': ['Картофель', 'Мясо', 'Специи'],
    'Зразы мясные с картофелем': ['Фарш', 'Картофель', 'Лук'],
    'Блины с мясом': ['Мука', 'Молоко', 'Яйцо', 'Фарш'],
    'Блины с творогом': ['Мука', 'Молоко', 'Яйцо', 'Творог'],
    'Сырники': ['Творог', 'Яйцо', 'Мука'],
    'Оладьи с яблоками': ['Мука', 'Яйцо', 'Молоко', 'Яблоко'],
    'Яблочный пирог': ['Мука', 'Яблоко', 'Сахар', 'Яйцо'],
    'Салат "Оливье"': [
        'Картофель', 'Морковь', 'Горошек', 'Огурцы соленые', 'Колбаса',
        'Майонез'
    ],
    'Салат "Винегрет"':
    ['Свекла', 'Картофель', 'Морковь', 'Огурцы соленые', 'Лук'],
    'Мясо по-французски': ['Мясо', 'Сыр', 'Томат'],
    'Запеканка творожная': ['Творог', 'Сахар', 'Яйцо'],
    'Картофельные зразы': ['Картофель', 'Фарш'],
    'Тефтели в томатном соусе': ['Фарш', 'Рис', 'Томат'],
    'Фрикасе из курицы': ['Курица', 'Морковь', 'Лук'],
    'Картошка тушеная с мясом': ['Картофель', 'Мясо'],
    'Капуста тушеная с колбасой': ['Капуста', 'Колбаса'],
    'Паста с курицей и грибами': ['Макароны', 'Курица', 'Грибы'],
    'Рулетики из куриного филе': ['Курица', 'Сыр', 'Томат'],
    'Картофельные драники': ['Картофель', 'Лук', 'Мука'],
    'Яичница с помидорами': ['Яйцо', 'Томат'],
    'Яичница с грибами': ['Яйцо', 'Грибы'],
    'Сырный суп с брокколи': ['Брокколи', 'Сыр', 'Молоко'],
    'Рис с курицей': ['Рис', 'Курица'],
    'Гороховый суп': ['Горох', 'Мясо', 'Картофель', 'Морковь'],
    'Суп лапша с курицей': ['Курица', 'Лапша'],
    'Салат с курицей и овощами':
    ['Курица', 'Огурец свежий', 'Томат', 'Зелень'],
    'Спагетти с баклажанами и томатами': ['Спагетти', 'Баклажан', 'Томат'],
    'Салат из свеклы с сыром': ['Свекла', 'Сыр'],
    'Тыквенный суп-пюре': ['Тыква', 'Морковь', 'Лук'],
    'Кабачковые оладьи с творогом': ['Кабачок', 'Творог', 'Мука', 'Яйцо'],
    'Шарлотка с яблоками': ['Мука', 'Сахар', 'Яблоко', 'Яйцо'],
    'Суп с фрикадельками': ['Фарш', 'Рис', 'Лук', 'Морковь'],
    'Котлеты по-киевски': ['Курица', 'Масло', 'Яйцо', 'Мука'],
    'Пирог с капустой': ['Мука', 'Капуста', 'Яйцо', 'Сметана'],
    'Окрошка': ['Квас', 'Огурцы соленые', 'Картофель', 'Колбаса', 'Зелень'],
    'Пельмени': ['Мука', 'Фарш', 'Яйцо'],
    'Вареники с картофелем': ['Мука', 'Картофель', 'Лук'],
    'Пирожки с яблоками': ['Мука', 'Яблоко', 'Сахар', 'Яйцо'],
    'Картофельный салат с огурцами':
    ['Картофель', 'Огурцы свежие', 'Майонез', 'Зелень'],
    'Салат "Цезарь" с курицей':
    ['Курица', 'Салат Романо', 'Сухарики', 'Пармезан', 'Соус Цезарь'],
    'Паста с лососем и шпинатом':
    ['Лосось', 'Паста', 'Шпинат', 'Сливки', 'Лимон'],
    'Картофельный суп с грибами':
    ['Картофель', 'Грибы', 'Лук', 'Сливки', 'Зелень'],
    'Омлет с сыром и шпинатом': ['Яйцо', 'Сыр', 'Шпинат', 'Молоко'],
    'Креветки в чесночном соусе': ['Креветки', 'Чеснок', 'Масло', 'Петрушка'],
    'Лазанья с мясом и бешамелью':
    ['Мясо', 'Лазанья', 'Бешамельный соус', 'Сыр'],
    'Суп-гуляш с говядиной':
    ['Говядина', 'Помидоры', 'Лук', 'Паприка', 'Картофель'],
    'Карри с курицей и кокосовым молоком':
    ['Курица', 'Карри-паста', 'Кокосовое молоко', 'Овощи'],
    'Пицца с пепперони':
    ['Тесто для пиццы', 'Томатный соус', 'Сыр', 'Пепперони'],
    'Греческий салат':
    ['Помидоры', 'Огурцы свежие', 'Оливки', 'Сыр Фета', 'Оливковое масло'],
    'Паста с креветками и сливками':
    ['Креветки', 'Паста', 'Сливки', 'Чеснок', 'Пармезан'],
    'Картофель фри': ['Картофель', 'Масло', 'Специи'],
    'Фруктовый салат': ['Яблоко', 'Апельсин', 'Банан', 'Виноград', 'Мед'],
    'Мексиканская чили': [
        'Фарш', 'Помидоры', 'Красная фасоль', 'Кукуруза', 'Чили-пудра'
    ],
    'Пельмени с соусом': ['Пельмени', 'Сметана', 'Зелень'],
    'Салат "Греческий"': [
        'Помидоры', 'Огурцы свежие', 'Лук красный', 'Сыр Фета',
        'Оливковое масло'
    ],
    'Салат "Цезарь" с лососем': [
        'Лосось', 'Салат Романо', 'Сухарики', 'Пармезан', 'Соус Цезарь'
    ],
    'Суп-пюре из брокколи': [
        'Брокколи', 'Картофель', 'Лук', 'Сливки', 'Специи'
    ],
    'Омлет с грибами и сыром': ['Яйцо', 'Грибы', 'Сыр', 'Молоко'],
    'Салат "Винегрет" с огурцами': [
        'Свекла', 'Картофель', 'Огурцы свежие', 'Лук', 'Морковь'
    ],
    'Запеченные баклажаны с мясом': ['Баклажан', 'Мясо', 'Помидоры', 'Сыр'],
    'Роллы с лососем и авокадо': [
        'Лосось', 'Авокадо', 'Рис для суши', 'Нори', 'Соевый соус'
    ],
    'Паста с оливками и тунцом': [
        'Паста', 'Тунец', 'Оливки', 'Помидоры', 'Оливковое масло'
    ],
    'Суп "Харчо"': ['Говядина', 'Рис', 'Помидоры', 'Лук', 'Чили'],
    'Пирог с ягодами': ['Мука', 'Ягоды', 'Сахар', 'Яйцо'],
    'Омлет с беконом': ['Яйцо', 'Бекон', 'Молоко'],
    'Салат "Греческий" с куриной грудкой': [
        'Курица', 'Салат Романо', 'Оливки', 'Сыр Фета', 'Оливковое масло'
    ],
    'Салат "Оливье" с куриной грудкой': [
        'Курица', 'Картофель', 'Горошек', 'Огурцы соленые', 'Майонез'
    ],
    'Пицца с грибами и беконом': [
        'Тесто для пиццы', 'Томатный соус', 'Сыр', 'Грибы', 'Бекон'
    ],
    'Спагетти с карбонарой': ['Спагетти', 'Гуанчиале', 'Яйцо', 'Сыр Пармезан'],
    'Тыквенный пирог': ['Тыква', 'Сахар', 'Яйцо', 'Специи'],
    'Салат с авокадо и креветками': [
        'Авокадо', 'Креветки', 'Помидоры', 'Лук', 'Лимонный соус'
    ],
    'Запеченный лосось': ['Лосось', 'Лимон', 'Специи', 'Зелень'],
    'Бургер с говяжьей котлетой': [
        'Булочка', 'Говяжья котлета', 'Салат', 'Томат', 'Соус'
    ],
    'Пельмени с грибами': ['Пельмени', 'Грибы', 'Лук', 'Сливки', 'Специи'],
    'Котлеты из индейки': ['Индейка', 'Сухари', 'Яйцо', 'Специи'],
    'Салат с креветками и авокадо': [
        'Креветки', 'Авокадо', 'Манго', 'Зелень', 'Лаймовый соус'
    ],
    'Омлет с лососем и сыром': ['Яйцо', 'Лосось', 'Сыр', 'Сметана'],
    'Рыбный суп с картофелем': ['Рыба', 'Картофель', 'Лук', 'Специи'],
    'Паста с красным соусом и мясом': ['Паста', 'Мясо', 'Помидоры', 'Специи'],
    'Картофельные оладьи': ['Картофель', 'Лук', 'Яйцо', 'Мука', 'Специи'],
    'Пирог с курицей и грибами': ['Курица', 'Грибы', 'Лук', 'Сметана', 'Мука'],
    'Запеченные кабачки с сыром': ['Кабачок', 'Сыр', 'Специи'],
    'Фасолевый суп': [
        'Красная фасоль', 'Картофель', 'Лук', 'Морковь', 'Специи'
    ],
    'Салат "Цезарь" с лососем и авокадо': [
        'Лосось', 'Салат Романо', 'Сухарики', 'Пармезан', 'Соус Цезарь',
        'Авокадо'
    ],
    'Салат с тунцом и оливками': [
        'Тунец', 'Помидоры', 'Оливки', 'Лук', 'Оливковое масло'
    ],
    'Пельмени с картошкой': [
        'Пельмени', 'Картофель', 'Лук', 'Сливки', 'Специи'
    ],
    'Тайский суп с креветками и кокосовым молоком': [
        'Креветки', 'Кокосовое молоко', 'Лемонграсс', 'Чили', 'Кориандр'
    ],
    'Суп-лапша с грибами и курицей': [
        'Грибы', 'Курица', 'Лапша', 'Лук', 'Специи'
    ],
    'Паста с брокколи и пармезаном': [
        'Паста', 'Брокколи', 'Пармезан', 'Чеснок', 'Оливковое масло'
    ],
    'Салат с яйцом и беконом': [
        'Яйцо', 'Бекон', 'Салат', 'Помидоры', 'Майонез'
    ],
    'Роллы с лососем и огурцом': [
        'Лосось', 'Огурец свежий', 'Рис для суши', 'Нори', 'Соевый соус'
    ],
    'Суп-пюре из тыквы': ['Тыква', 'Картофель', 'Лук', 'Сливки', 'Специи'],
}
